import { Actor } from "@/types/actor";
import { Movie } from "@/types/movie";

const mockActorMovies: Movie[] = [
  {
    image: "movie-1",
  },
  {
    image: "movie-2",
  },
  {
    image: "movie-3",
  },
  {
    image: "movie-4",
  },
  {
    image: "movie-5",
  },
];

const mockActor: Actor = {
  id: "1",
  name: "Тони Михајловски",
  image: "toni-mihajlovski",
  bio: "Михајловски е роден во Куманово на 1 јули 1967 година. Тој по завршувањето на Факултет за драмски уметност во Скопје, станува член на Драмата при Македонски народен театар во 1994 година. Во 2010 тој станал добитник на наградата за најдобар глумец на петтиот меѓународен театарски фестивал „Јоаким Интер фест“ во Крагуевац, Србија",
  achievements: [
    'Награда за најдобар глумец на фестивалот "Јоаким Интер Фест" (2010)',
    'Награда за најдобро глумечко остварување на МТФ "Војдан Чернодрински" Прилеп за улогата за "Ефрем Поплавски" во претставата "Вечната куќа" (2013)',
    "Награда 13 ноември на град Скопје (2022)",
  ],
  movies: mockActorMovies,
};

export const actorOverviewMockData = (_actorId?: string): Actor => mockActor;
